Application/advanced/backend/views/attendance/_form.php

SELECT * FROM `course`
SELECT * FROM `employee`
SELECT * FROM `student`
SELECT * FROM `schedule`
---

    <?= $form->field($model, 'status')->dropDownList([ 'Absent' => 'Absent', 'Late' => 'Late', 'Excuse' => 'Excuse', 'Present' => 'Present', ], ['prompt' => '']) ?>

    <?= $form->field($model, 'class_list_course_id')->dropDownList(
        ArrayHelper::map(Course::find()->all(), 'id', 'title'),
        [
            'prompt'=>'Select Course',
        ]); ?>

    <?= $form->field($model, 'class_list_course_employee_id')->dropDownList(
        ArrayHelper::map(Employee::find()->all(), 'id', 'first_name'),
        [
            'prompt'=>'Select Employee',
        ]); ?>

    <?= $form->field($model, 'class_list_student_id')->dropDownList(
        ArrayHelper::map(Student::find()->all(), 'id', 'first_name'),
        [
            'prompt'=>'Select Students',
        ]); ?>

    <?= $form->field($model, 'schedule_id')->dropDownList(
        ArrayHelper::map(Schedule::find()->all(), 'id', 'day'),
        [
            'prompt'=>'Select Students',
        ]); ?>