Application/advanced/backend/views/stud-answer/_form.php


    <?= $form->field($model, 'choice_question_id')->textInput() ?>

    <?= $form->field($model, 'student_id')->dropDownList(
        ArrayHelper::map(Student::find()->all(), 'id', 'title'),
        [
            'prompt'=>'Select Student',
        ]); ?>
---
SELECT * FROM `student`