Application/advanced/backend/views/question/_form.php

SELECT * FROM `task`
SELECT * FROM `course`
SELECT * FROM `employee`
---

    <?= $form->field($model, 'ask')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'task_id')->dropDownList(
        ArrayHelper::map(Task::find()->all(), 'id', 'title'),
        [
            'prompt'=>'Select Task',
        ]); ?>

    <?= $form->field($model, 'task_course_id')->dropDownList(
        ArrayHelper::map(Course::find()->all(), 'id', 'title'),
        [
            'prompt'=>'Select Course',
        ]); ?>

    <?= $form->field($model, 'task_course_employee_id')->dropDownList(
        ArrayHelper::map(Employee::find()->all(), 'id', 'title'),
        [
            'prompt'=>'Select Employee',
        ]); ?>